<!-- 
* ======================================================================== 
* Copyright (c) 2008 - Opens Tecnologia - Projeto SNEP            
* Licenciado sob Creative Commons. Veja arquivo ./doc/licenca.txt 
* Autor: Flavio Henrique Somensi <flavio@opens.com.br>
* ========================================================================
-->
<h2>Status das Filas</h2>


<p>Para que a lista de Filas Dispon&iacute;veis esteja vis&iacute;vel &eacute; necess&aacute;rio que as mesmas estejam definidas como
"Autorizadas" no cadastro do usu&aacute;rio/ramal em uso (veja o Menu: Cadastros >> Ramais).</p>

<strong>Filas:</strong>  Selecione   a(s)   Fila(s)   que   deseja   monitorar   selecionando­a(s)   e     movendo­a(s)   para   a   "Caixa
Selecionadas" usando a seta para direita.

<br /><br />

<strong>Ver Status F&iacute;sico dos Ramais:</strong>  Selecionando "Sim", ir&aacute; exibir, quando dispon&iacute;vel, informa&ccedil;&otilde;es sobre a
esta&ccedil;&atilde;o de trabalho onde o Ramal est&aacute; conectado fisicamente. Esta op&ccedil;&atilde;o &eacute; particularmente útil quando se
usa Softphones (Software que simula uma telefone - veja cap&iacute;tulo espec&iacute;fico sobre isso neste Manual) .
Ao clicar no bot&atilde;o "Visualizar", uma tela com a Lista de todos os membros de cada Fila ser&aacute; exibida,
assim como informa&ccedil;&otilde;es da Fila e de cada membro  da fila:

<br /><br />

<p>Esta rotina permite que seja monitorado o Status de cada membro da(s)
 Fila(s) selecionada. Para que a lista de Filas Dispon&iacute;veis esteja vis&iacute;vel
 &eacute; necess&aacute;rio que estas estejam cadastradas e a origem do cadastros (arquivo 
 texto ou banco de dados) esteja definido em: <a href="ajuda.php?script=parametros">Configura&ccedil;&otilde;es &gt;&gt; Par&acirc;metros</a>.</p>
 
 <p>Ap&oacute;s selecionar a(s) Fila(s) desejada(s), mova-a(s) para a &quot;Caixa Selecionadas&quot;
 e ent&atilde;o clique no bot&atilde;o &quot;Visualizar&quot;. Um tela com a Lista de todos os Membros
 de cada Fila ser&aacute; exibida, assim como algumas informa&ccedil;&otilde;es de cada
 membro da fila, como:</p>
 <ul> 
    <li>Status</li>
    <li>Hora do Login</li>
    <li>Tempo decorrido desde que a &uacute;ltima liga&ccedil;&atilde;o foi atendida</li>
    <li>Quantas liga&ccedil;&otilde;es foram atendidas</li>
    <li>N&uacute;mero do Telefone com quem ele est&aacute; falando</li>
    <li>etc...</li>
 </ul>  
 <h3>ALARMES</h3>
 <p>As Filas possuem um sistema de alerta que dispara 3 eventos distintos e 
 configur&aacute;veis: </p>
 <ul> 
    <li>Alerta Sonoro</li>
    <li>Alerta Visual</li>
    <li>Alerta por E-mail</li>
 </ul>
 <p>As condi&ccedil;&otilde;es de disparo destes Alertas podem ser configuradas de forma gen&eacute;rica, 
 ou seja, para todas as filas, em <a href="ajuda.php?script=parametros">
 Configura&ccedil;&otilde;es &gt;&gt; Par&acirc;metros</a>, ou ent&atilde;o , individualmente 
 em <a href="ajuda.php?script=parametros">Cadastros &gt;&gt; Filas</a></p>    
<p>Links Relacionados:</p>
<ul>
   <li><a href="ajuda.php?script=rel_queues">Filas</a></li> 
   <li><a href="ajuda.php?script=rel_ramais">Ramais</a></li>
   <li><a href="ajuda.php?script=parametros">Par&acirc;metros</a></li>
</ul>    
