<!--
* ========================================================================
* Copyright (c) 2008 - Opens Tecnologia - Projeto SNEP
* Licenciado sob Creative Commons. Veja arquivo ./doc/licenca.txt
* Autor: Flavio henrique Somensi <flavio@opens.com.br>
* ========================================================================
-->
<h2>Filas - Incluir/Alterar</h2>

<p>Esta rotina permite a Inclus&atilde;o ou Altera&ccedil;&atilde;o do Cadastro 
de uma Fila de Atendimento.</p>
<p>As Filas s&atilde;o uma das funcionalidades que o Asterisk tem para a implementa&ccedil;&atilde;o
 de um call center b&aacute;sico</p>
<ul>
   <li><strong>Nome:</strong> Nome da Fila - N&atilde;o use espa&ccedil;os ou caracters acentuados/especiais como: &ccedil;&atilde;&eacute;@#%... </li>
   <li><strong>Classe das M&uacute;sicas de Espera: </strong>Conjunto de arquivos de som a
   serem usados como M&uacute;sicas de Espera. (<a href="ajuda.php?script=rel_musiconhold">v+: Configura&ccedil;&otilde;es >> M&uacute;sicas em Espera</a>)</li>
   <li><strong>Arquivo de An&uacute;ncio da Fila: </strong>Define o arquivo de som que 
   cont&eacute;m a mensagem informando o nome da fila que o chamador est&aacute;.</li>
   <li><strong>Para qual contexto... : </strong>Define o contexto para qual a
    chamada ser&aacute; desviada quando o chamador solicitar.</li>
   <li><strong>Arquivo de Mensagem: </strong>
       <ul>
          <li>Voc&ecirc; &eacute; o pr&oacute;ximo da Fila</li>
          <li>Voc&ecirc; est&aacute; aqui</li>
          <li>Existen 'n' chamadas aguardando</li>
          <li>Obrigado por aguardar</li>
       </ul>
       Estes campos definem os arquivos de som que ser&atilde;o executados na ocorr&ecirc;ncia
       de cada situa&ccedil;&atilde;o acima relacionada. 
   </li>
   <li><strong>Intervalo de Repeti&ccedil;&atilde;o das Mensagens: </strong>Tempo em SEGUNDOS que as
    mensagens ser&atilde;o repetidas pelo sistema</li>
   <li><strong>Ap&oacute;s 'timeout', intervalo ... : </strong>Quando algum prazo
    expira, tempo em SEGUNDOS que a chamada espera at&eacute; ser apresentada novamente 
    a um Agente dispon&iacute;vel</li>
   <li><strong>Tempo de descanso ... : </strong>Tempo em SEGUNDOS que o Agente tem 
    de descanso entre o final de uma chamada e o in&iacute;cio de outra.</li>
   <li><strong>N&uacute;mero m&aacute;ximo de... : </strong>Quantidade de chamadas que podems er adicionadas &agrave; fila 
    antes que uma chamada v&aacute; para a pr&oacute;xima prioridade do ramal atual.</li>
   <li><strong>Tempo de espera de... : </strong>Tempo m&aacute;ximo em SEGUNDOS que um chamador deeria
    esperar antes de ser apresentado a um agente.</li>
   <li><strong>Estrat&eacute;gia de distribui&ccedil;&atilde;o... : </strong>Estrat&eacute;gias de distribui&ccedil;&atilde;o
    de chamadas aos agentes.</li>
   <li><strong>Chamadas podem entrar na fila... : </strong>Permite que seja determinado se
    os chamadores poder&atilde;o ser adicionados ou n&atilde;o &agrave; fila baseando-se no estado dos membros
    da fila. A op&ccedil;&atilde;o <strong>Restrito (strict)</strong> n&atilde;o permitir&aacute; que os chamadores juntem-se &agrave; fila se todos os membros
     estiverem indispon&iacute;veis.</li>
   <li><strong>Chamadas devem sair ... : </strong>Determina se voc&ecirc; deseja que os chamadores
     em espera sejam removidos ou n&atilde;o da fila quando as condi&ccedil;&otilde;es que evitam que o chamador 
     se junte a ela existirem (isto &eacute;, quando todos os seus agentes fazem logout e v&atilde;o
      embora. </li>
   <li><strong>Avisar ao Agente o tempo... : </strong>Avisa ao Agente o tempo que o
     chamador esperou antes de ser atendido.</li>
   <li><strong>Tempo entre identifica&ccedil;&atilde;o... : </strong>Tempo em SEGUNDOS para um retardo
     entre o tempo que a fila identifica um agente dispon&iacute;vel e o tempo que a chamada &eacute;
     conectada a tal agente.</li>
   <li><strong>Prioridade da Fila: </strong>Atribui uma classifica&ccedil;&atilde;o a Fila. Se as 
      chamadas estiverem esperando emm&uacute;ltiplas filas, as filas com peso MAIOR ser&atilde;o 
      apresentadas aos agentes primeiro</li>
   <li><strong>CONFIGURA&Ccedil;&Otilde;ES DE ALERTA</strong><br>
      Estas configura&ccedil;&otilde;es se aplicam &agrave; rotina <a href="ajuda.php?script=queues">Status >> Filas</a> 
      <ul>
         <li><strong>N&uacute;mero de Liga&ccedil;&otilde;es ... :</strong>Define o n&uacute;mero de liga&ccedil;&otilde;e que dever&atilde;o 
         estar em espera para que o sistema emite o alerta visual/sonoro.</li>
         <li><strong>Tempo M&aacute;ximode espera ... : </strong>Tempo em SEGUNDOS que uma 
         liga&ccedil;&atilde;o em espera pode atingir para que o sistema emite o alerta visual/sonoro.</li>
         <li><strong>E-mail para envio ... : </strong>Define o e-maiL(s) que dever&aacute; 
         receber um alerta das condi&ccedil;&otilde;es que dispararam um dos ou ambos alarmes.</li>
      </ul>  
   </li>
</ul> 
  