<!-- 
* ========================================================================
* Copyright (c) 2008 - Opens Tecnologia - Projeto SNEP            
* Licenciado sob Creative Commons. Veja arquivo ./doc/licenca.txt 
* Autor: Flavio Henrique Somensi <flavio@opens.com.br>
* ========================================================================
-->
<h2>Relat&oacute;rio de Estat&iacute;sticas do Operador</h2>

<p>Este Relat&oacute;rio permite que sejam visualizados dados estat&iacute;sticos
de um ou mais operadores (ramal), também como a tarifação dentro de um per&iacute;odo especificado.</p>
<p>Alguns filtros podem ser aplicados a este Relatório, sendo:</p>
<ul>
   <li><strong>Per&iacute;odo: </strong>Define o intervalo de datas/hora do qual se
  deseja extrair as informa&ccedil;&otilde;es;</li>
  <li><strong>Ramais: </strong>Lista de Ramal(is) de quais se deseja as estat&iacute;siticas.</li>
  <li><strong>Somente dados de: </strong>Define os dias da semana dos quais se
  deseja as estat&iacute;sticas</li>
</ul>
Este relat&oacute;rio mostra , acumulado em cada dia do per&iacute;odo solicitado:
<ul>
   <li>Chamadas Originadas , Recebidas e Outras<strong>(*1)</strong>
      <ul>
        <li>N&uacute;mero de Chamadas Atendidas, N&atilde;o Atendidas, Ocupadas e Total</li>
        <li>Tempo TOTAL das Chamadas, de  Atendidimento e de Esperaas</li>
        <li>Tempo M&Eacute;DIO das Chamadas, de  Atendidimento e de Esperaas</li>
        <li>Total tarifado em dias, periodo e por operador.</li>
      </ul>
      <strong>(*1)</strong> Outras compreende todas as chamadas cujo Centro de Custo esteja definido como "Outras" ou ent&atilde;o chamadas que n&atilde;o tem Centro de Custos definido. Exemplo: Internas, Login/Logoff de Agentes, Servi&ccedil;os (190, 192, ...), etc
   </li>
   <br />
   <li>Totais do Per&iacute;odo Solicitado</li>
      <ul>
        <li>N&uacute;mero de Chamadas Atendidas, N&atilde;o Atendidas, Ocupadas e Total</li>
        <li>Tempo TOTAL das Chamadas, de  Atendidimento e de Esperaas</li>
        <li>Tempo M&Eacute;DIO das Chamadas, de  Atendidimento e de Esperaas</li>
        <li>Tarifação das chamadas originadas.</li>
      </ul>
   </li>
   <br />
   <li>Taxas de Ocupa&ccedil;&atilde;o para Chamadas Originadas, Recebidas e Total</li>
   <br />
   <li>O Sinal Gr&aacute;fico ao Lado da Quantidade indica a disponibilidade de visualizar a lista detalhada dos registros que comp&otilde;e esta Quantidade.</li>
</ul>

<li><strong>Exportar CSV:</strong> Gera relat&oacute;rio no formato CSV (Valores separados por v&iacute;rgula) afim
  de tais informa&ccedil;&otilde;es sejam utilizadas em Planilhas Eletr&ocirc;nicas e outros Softwares estat&iacute;sticos.</li>
