<!--
* ========================================================================
* Copyright (c) 2008 - Opens Tecnologia - Projeto SNEP
* Licenciado sob Creative Commons. Veja arquivo ./doc/licenca.txt
* Autor: Rafael Bozzetti <rafael@opens.com.br>
* ========================================================================
-->
<h2>Relat&oacute;rio de Filas de Atendimento.</h2>

<p>
Permite que voc&ecirc; visualize e gere relat&oacute;rios da movimenta&ccedil;&atilde; o dos atendentes nas filas de
atendimento, sendo possivel gerar relat&oacute;rios entre intervalo de datas, por fila de atendimento
espec&iacute;fica ou por lista de agentes.
</p>

 <ul>
   <li><strong>C&oacute;digo:</strong> Registro &uacute;nico da chamada no sistema. <br />
   <li><strong>Data e Hor&aacute;rio:</strong> Registro de data e hora do evento.<br />
   <li><strong>Fila:</strong> Registro da fila de atendimento em que a chamada foi efetuada/atendida.<br />
   <li><strong>Canal:</strong> Registra o canal em que o evento aconteceu, lista o Agente que esteve envolvido com este atendimento.<br />
   <li><strong>Origem:</strong> Registra o numero de origem da chamada no momento em que ela entra na fila.<br />
   <li><strong>Tempo:</strong> Registra o tempo que ocorreu o evento dentro do tempo total da chamada.<br />
   <li><strong>Evento:</strong> Eventos registrados de cada chamada.</strong>
   <br /><br />

  <strong>Entrou na Fila:</strong> Liga&ccedil;&atilde;o entrou na fila de atendimento, após este momento as ligações s&atilde;o distribuidas aos Agentes.
  <br />
  <strong>Atendida:</strong> Evento em que a ligação é encaminhada a determinado Agente, que ser&aacute; indicado no campo <strong>Canal</strong>.
  <br />
  <strong>Finalizada:</strong> Evento que caracteriza o final da liga&ccedil;&atilde;o, quando o atendente ou atendido finalizam a chamada. O tempo de conversa&ccedil;&atilde;o &eacute; registrado na coluna <strong>Tempo</strong>.
  <br />
  <strong>Abandonada:</strong> Evento em que a liga&ccedil;&atilde;o &eacute; abandonada ou perdida.
  <br />
  <strong>N&atilde;o Atendida :</strong> Evento em que a chamada n&atilde; foi atendida pelo Agente.
  <br />
  <br />
 </ul>
 <li><strong>Exportar CSV:</strong> Gera relat&oacute;rio no formato CSV (Valores separados por v&iacute;rgula) afim
  de tais informa&ccedil;&otilde;es sejam utilizadas em Planilhas Eletr&ocirc;nicas e outros Softwares estat&iacute;sticos.</li>
